Revit 2027 API
FabricationConfiguration.GetAllAirturnIds Method
 Gets all available air turn identifiers.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<int> GetAllAirturnIds()
Public Function GetAllAirturnIds As IList(Of Integer)
public:
IList<int>^ GetAllAirturnIds()
member GetAllAirturnIds : unit -> IList<int>
Return Value
IList<Int32>
 Returns an array of available air turn identifiers.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace